app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `employees`
SELECT COUNT(*) AS `numrows` FROM `offices`
---
    public function index()
    {
        if (!session()->get('isLoggedIn')) return redirect()->to('/auth/login');

        // Logic to fetch overview counts for the dashboard cards
        $db = \Config\Database::connect();
        $data['total_employees'] = $db->table('employees')->countAll();
        $data['total_offices'] = $db->table('offices')->countAll();