app/Controllers/Employee.php

    public function index()
    {
        $model = new EmployeeModel();
        $officeModel = new OfficeModel();

        $officeFilter = $this->request->getVar('office_id');
        $search = $this->request->getVar('search');

$query = $model->select('employees.*, offices.office_name')
                       ->join('offices', 'offices.id = employees.office_id', 'left');

        if ($officeFilter) $query->where('office_id', $officeFilter);
        if ($search) $query->like('full_name', $search)->orLike('employee_id', $search);

        $data['employees'] = $query->findAll();
        $data['offices'] = $officeModel->findAll();
---
SELECT `employees`.*, `offices`.`office_name`
FROM `employees`
LEFT JOIN `offices` ON `offices`.`id` = `employees`.`office_id`
SELECT *
FROM `offices`

public function create()
{
    $officeModel = new OfficeModel();
    $model = new EmployeeModel();

    $year = date('Y');
    $count = $model->like('employee_id', "EMP-{$year}-", 'after')->countAllResults();
    $nextNumber = str_pad($count + 1, 3, '0', STR_PAD_LEFT);
    $data['generated_id'] = "EMP-{$year}-{$nextNumber}";

    $data['offices'] = $officeModel->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `employees`
WHERE `employee_id` LIKE 'EMP-2026-%' ESCAPE '!'
SELECT *
FROM `offices`