app/Controllers/Office.php

INSERT INTO `offices` (`office_name`) VALUES ('rata')
---
public function store()
    {
        $model = new OfficeModel();
        $name = $this->request->getPost('office_name');

        if (!$name) {
            return $this->response->setJSON(['success' => false, 'message' => 'Office name is required.']);
        }

        $id = $model->insert(['office_name' => $name]);