app/Controllers/Payroll.php


    $data['employees'] = $officeId ?
        $empModel->where('employees.office_id', $officeId)->findAll() :
        $empModel->findAll();
---
SELECT *
FROM `offices`