app/Models/OfficeModel.php

    public function getOfficesOrdered(bool $excludeRata = false)
    {
        $priority = [
            "MAYOR'S", 'VICE-SB', 'MCR', 'MPDC', "ENGR'NG", 'ACCTG.', 'MTO',
            'MASSO', 'MBO-MARKET', 'MHO', 'MAO', 'MBDO', 'LDRRMO', 'MSWD',
        ];

        $offices = $this->findAll();
---
SELECT *
FROM `offices`